In [53]:
#libs
import pandas as pd
import psycopg2
import numpy as np

In [62]:
##Config variables
settings = {
    'host': 'pg_container', #or: 172.20.0.2 IPAddress
    'user': 'postgres',
    'dbname': 'DataWarehouse',
    'password': 'admin'
}

In [63]:
conn = psycopg2.connect(**settings)

In [64]:
#lendo dados do data set de treino
df = pd.read_sql("SELECT * FROM data_train;", con = conn)

conn.close()
df.head()

,id,gender,age,driving_license,region_code,previously_insured,vehicle_age,vehicle_damage,annual_premium,policy_sales_channel,vintage,response
0,1,Male,44,1,28,0,> 2 Years,Yes,40454,26,217,1
1,2,Male,76,1,3,0,1-2 Year,No,33536,26,183,0
2,3,Male,47,1,28,0,> 2 Years,Yes,38294,26,27,1
3,4,Male,21,1,11,1,< 1 Year,No,28619,152,203,0
4,5,Female,29,1,41,1,< 1 Year,No,27496,152,39,0

In [50]:
df.dtypes

id                       int64
gender                  object
age                      int64
driving_license          int64
region_code             object
previously_insured       int64
vehicle_age             object
vehicle_damage          object
annual_premium          object
policy_sales_channel    object
vintage                 object
response                 int64
dtype: object

In [51]:
df[['age']].describe()

                 age
count  381109.000000
mean       38.822584
std        15.511611
min        20.000000
25%        25.000000
50%        36.000000
75%        49.000000
max        85.000000

In [52]:
#https://www.tutorialspoint.com/python_pandas/python_pandas_groupby.htm
print (df.groupby('vehicle_age').groups)

{'1-2 Year': [1, 7, 10, 12, 13, 14, 15, 18, 19, 20, 21, 23, 24, 26, 29, 31, 32, 35, 36, 38, 39, 41, 43, 45, 47, 49, 52, 53, 54, 56, 57, 58, 60, 63, 64, 65, 66, 67, 68, 69, 70, 73, 74, 75, 76, 78, 79, 80, 82, 83, 84, 92, 93, 96, 100, 105, 107, 108, 109, 113, 115, 116, 120, 121, 122, 123, 125, 130, 135, 136, 138, 141, 143, 148, 152, 153, 155, 156, 157, 161, 162, 163, 164, 166, 168, 172, 177, 178, 179, 180, 181, 182, 183, 184, 185, 187, 188, 189, 194, 195, ...], '< 1 Year': [3, 4, 5, 6, 8, 9, 11, 16, 17, 22, 25, 27, 28, 30, 33, 34, 37, 40, 42, 44, 46, 48, 50, 51, 55, 59, 61, 71, 72, 77, 81, 85, 87, 88, 89, 90, 91, 94, 95, 98, 99, 101, 102, 103, 104, 106, 110, 112, 114, 117, 118, 119, 124, 126, 127, 128, 129, 131, 132, 133, 134, 137, 139, 140, 142, 144, 145, 146, 147, 149, 150, 151, 154, 158, 159, 160, 165, 167, 169, 170, 171, 173, 174, 175, 176, 190, 191, 192, 193, 198, 202, 204, 205, 206, 207, 208, 209, 215, 217, 218, ...], '> 2 Years': [0, 2, 62, 86, 97, 111, 186, 212, 216, 223, 224, 239, 255, 277, 283, 310, 372, 381, 382, 409, 412, 463, 465, 470, 480, 541, 559, 562, 616, 618, 621, 627, 688, 734, 748, 755, 839, 882, 911, 937, 958, 1008, 1031, 1032, 1076, 1081, 1152, 1171, 1176, 1188, 1223, 1257, 1306, 1373, 1413, 1418, 1419, 1428, 1440, 1444, 1445, 1456, 1470, 1502, 1513, 1516, 1517, 1549, 1553, 1566, 1628, 1652, 1661, 1671, 1732, 1735, 1760, 1786, 1793, 1817, 1846, 1850, 1888, 1889, 1896, 1900, 1914, 1926, 1931, 1938, 1978, 1999, 2003, 2015, 2017, 2050, 2078, 2080, 2081, 2105, ...]}

In [44]:
grouped = df.groupby('vehicle_age')
for name,group in grouped:
   print (name)
   print (group)

1-2 Year
<built-in function id>
< 1 Year
<built-in function id>
> 2 Years
<built-in function id>

In [79]:
total=df['id'].count()
print(total)

381109

In [80]:
total_response=df['response'].sum()
print(total_response)

46710

In [84]:
perc_response=total_response/total
print(perc_response)

0.12256336113815208

In [118]:
grouped = df.groupby('vehicle_damage')
valor = grouped['response'].agg(np.sum)/total_response
print(valor)

vehicle_damage
No     0.021023
Yes    0.978977
Name: response, dtype: float64

In [120]:
grouped = df.groupby('gender')
print (grouped['response'].agg(np.sum)/total_response)

gender
Female    0.389317
Male      0.610683
Name: response, dtype: float64

In [119]:
grouped = df.groupby('vehicle_age')
print (grouped['response'].agg(np.sum)/total_response)

vehicle_age
1-2 Year     0.745151
< 1 Year     0.154185
> 2 Years    0.100664
Name: response, dtype: float64